verilog_defaults -push
verilog_defaults -add -defer
read_verilog /home/svb/GIT.svb/vit74-Lcnc/build/colorlight_5a_75b/gateware/Lcnc.v
verilog_defaults -pop
attrmap -tocase keep -imap keep="true" keep=1 -imap keep="false" keep=0 -remove keep=0

synth_ecp5  -top Lcnc
write_json  Lcnc.json